RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["url", "www.doggos.com"], ["updated_at", "2018-11-20 22:52:31.411185"], ["id", 1]]

  def ensure_author
    redirect_to post_url(params[:id]) unless Post.find(params[:id]).user_id == current_user.id
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]