RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "Best Doggos"], ["updated_at", "2018-11-20 21:49:32.594336"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update_attributes(sub_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def ensure_moderator
    redirect_to sub_url(params[:id]) unless Sub.find(params[:id]).user_id == current_user.id