RedditClone/app/views/posts/edit.html.erb

    <br>
  <% Sub.all.each do |sub| %>
    <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
      <%= @post.sub_ids.include?(sub.id) ? "checked" : "" %>><%= sub.title %><br>
---
SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 2]]